TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_clbxbar.h
//###########################################################################
//
// FILE:    hw_clbxbar.h
//
// TITLE:   Definitions for the XBAR registers.
//
//###########################################################################
// $Copyright:
// Copyright (C) 2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_CLBXBAR_H
#define HW_CLBXBAR_H

//*************************************************************************************************
//
// The following are defines for the XBAR register offsets
//
//*************************************************************************************************
#define XBAR_O_AUXSIG0MUX0TO15CFG    0x0U    // CLB XBAR Mux Configuration for Output-0
#define XBAR_O_AUXSIG0MUX16TO31CFG   0x2U    // CLB XBAR Mux Configuration for Output-0
#define XBAR_O_AUXSIG1MUX0TO15CFG    0x4U    // CLB XBAR Mux Configuration for Output-1
#define XBAR_O_AUXSIG1MUX16TO31CFG   0x6U    // CLB XBAR Mux Configuration for Output-1
#define XBAR_O_AUXSIG2MUX0TO15CFG    0x8U    // CLB XBAR Mux Configuration for Output-2
#define XBAR_O_AUXSIG2MUX16TO31CFG   0xAU    // CLB XBAR Mux Configuration for Output-2
#define XBAR_O_AUXSIG3MUX0TO15CFG    0xCU    // CLB XBAR Mux Configuration for Output-3
#define XBAR_O_AUXSIG3MUX16TO31CFG   0xEU    // CLB XBAR Mux Configuration for Output-3
#define XBAR_O_AUXSIG4MUX0TO15CFG    0x10U   // CLB XBAR Mux Configuration for Output-4
#define XBAR_O_AUXSIG4MUX16TO31CFG   0x12U   // CLB XBAR Mux Configuration for Output-4
#define XBAR_O_AUXSIG5MUX0TO15CFG    0x14U   // CLB XBAR Mux Configuration for Output-5
#define XBAR_O_AUXSIG5MUX16TO31CFG   0x16U   // CLB XBAR Mux Configuration for Output-5
#define XBAR_O_AUXSIG6MUX0TO15CFG    0x18U   // CLB XBAR Mux Configuration for Output-6
#define XBAR_O_AUXSIG6MUX16TO31CFG   0x1AU   // CLB XBAR Mux Configuration for Output-6
#define XBAR_O_AUXSIG7MUX0TO15CFG    0x1CU   // CLB XBAR Mux Configuration for Output-7
#define XBAR_O_AUXSIG7MUX16TO31CFG   0x1EU   // CLB XBAR Mux Configuration for Output-7
#define XBAR_O_AUXSIG0MUXENABLE      0x20U   // CLB XBAR Mux Enable Register for Output-0
#define XBAR_O_AUXSIG1MUXENABLE      0x22U   // CLB XBAR Mux Enable Register for Output-1
#define XBAR_O_AUXSIG2MUXENABLE      0x24U   // CLB XBAR Mux Enable Register for Output-2
#define XBAR_O_AUXSIG3MUXENABLE      0x26U   // CLB XBAR Mux Enable Register for Output-3
#define XBAR_O_AUXSIG4MUXENABLE      0x28U   // CLB XBAR Mux Enable Register for Output-4
#define XBAR_O_AUXSIG5MUXENABLE      0x2AU   // CLB XBAR Mux Enable Register for Output-5
#define XBAR_O_AUXSIG6MUXENABLE      0x2CU   // CLB XBAR Mux Enable Register for Output-6
#define XBAR_O_AUXSIG7MUXENABLE      0x2EU   // CLB XBAR Mux Enable Register for Output-7
#define XBAR_O_AUXSIGOUTINV          0x38U   // CLB XBAR Output Inversion Register
#define XBAR_O_AUXSIGLOCK            0x3EU   // ClbXbar Configuration Lock register


//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG0MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG0MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG0 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG0MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG0MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG0 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG0MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG0MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG0 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG0MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG0MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG0 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG1MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG1MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG1 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG1MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG1MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG1 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG1MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG1MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG1 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG1MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG1MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG1 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG2MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG2MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG2 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG2MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG2MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG2 of
                                                        // CLB-XBAR

