TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_clbxbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG5MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG5MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG5 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG5MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG5MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG5 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG6MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG6MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG6 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG6MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG6MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG6 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG6MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG6MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG6 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG6MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG6MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG6 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG7MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG7MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG7 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG7MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG7MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG7 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG7MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG7MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG7 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG7MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG7MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG7 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG0MUXENABLE register
//
//*************************************************************************************************
#define XBAR_AUXSIG0MUXENABLE_MUX0    0x1U          // mux0 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX1    0x2U          // MUX1 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX2    0x4U          // MUX2 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX3    0x8U          // MUX3 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX4    0x10U         // MUX4 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX5    0x20U         // MUX5 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX6    0x40U         // MUX6 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX7    0x80U         // MUX7 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX8    0x100U        // MUX8 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX9    0x200U        // MUX9 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX10   0x400U        // MUX10 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX11   0x800U        // MUX11 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX12   0x1000U       // MUX12 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX13   0x2000U       // MUX13 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX14   0x4000U       // MUX14 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX15   0x8000U       // MUX15 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX16   0x10000U      // MUX16 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX17   0x20000U      // MUX17 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX18   0x40000U      // MUX18 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX19   0x80000U      // MUX19 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX20   0x100000U     // MUX20 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX21   0x200000U     // MUX21 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX22   0x400000U     // MUX22 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX23   0x800000U     // MUX23 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX24   0x1000000U    // MUX24 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX25   0x2000000U    // MUX25 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX26   0x4000000U    // MUX26 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX27   0x8000000U    // MUX27 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX28   0x10000000U   // MUX28 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX29   0x20000000U   // MUX29 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX30   0x40000000U   // MUX30 to drive AUXSIG0 of CLB-XBAR
#define XBAR_AUXSIG0MUXENABLE_MUX31   0x80000000U   // MUX31 to drive AUXSIG0 of CLB-XBAR

